const data = [
  {
    id: 0,
    question: '가장 선호하는 프론트엔드 SPA 라이브러리/ 프레임워크',
    answer: ['리액트', '뷰', '앵귤러', '스벨트', '기타'],
  },
  {
    id: 1,
    question: '배워보고싶은 새로운 기술 스택',
    answer: ['리액트 네이티브', '플러터', '타입스크립트', 'Tailwind', '기타'],
  },
  {
    id: 2,
    question: '부트캠프 오기 전 공부기간',
    answer: ['없음', '3개월', '6개월', '1년', '1년 이상'],
  },
  {
    id: 3,
    question: '지금 까지 공부하면서 가장 어려웠던 주제',
    answer: ['코플릿', '비동기', '리액트', '네트워크', '기타'],
  },
  {
    id: 4,
    question: '지금 까지 공부하면서 가장 쉬웠던 주제',
    answer: ['코플릿', '비동기', '리액트', '네트워크', '기타'],
  },
  {
    id: 5,
    question: '사용하는 컴퓨터 운영체제',
    answer: ['Mac', 'Window', 'Linux', '기타'],
  },
  {
    id: 6,
    question: '일하고 싶은 분야',
    answer: ['교육', '금융', '게임', '커머스', '기타'],
  },
  {
    id: 7,
    question: '프론트엔드 말고 관심있는 분야',
    answer: ['백엔드', 'DB', '데브옵스', '앱개발', '기타'],
  },
  {
    id: 8,
    question: '지금 제일 많이 공부하고있는 부분',
    answer: ['코딩 테스트', '리액트', '자바스크립트', 'CS 공부', '기타'],
  },
  {
    id: 9,
    question: '일하고 싶은 분야',
    answer: ['교육', '금융', '게임', '커머스', '기타'],
  },
  {
    id: 10,
    question: '개발공부를 위한 주된 학습 형태',
    answer: ['구글링', '유튜브', '강의', '도서', '기타'],
  },
  {
    id: 11,
    question: '(현실적인) 원하는 초봉',
    answer: ['3천 이하', '3천~3200', '3200 ~ 3400', '3400 ~ 3600', '4천 이상'],
  },
  {
    id: 12,
    question: '(정규 시간 제외) 하루에 개발 공부를 얼마나 하는지?',
    answer: ['0시간', '1시간', '2시간', '3시간', '5시간 이상'],
  },
  {
    id: 13,
    question: '전공자(컴퓨터 관련)? 비전공자?',
    answer: ['전공자', '비전공자'],
  },
  {
    id: 14,
    question: '취업 목표 기간 2023년 분기',
    answer: ['2023년 1분기', '2분기', '3분기', '4분기', '기타'],
  },
  {
    id: 15,
    question: '개발자 필수 아이템',
    answer: ['맥북', '손목보호대', '망치', '보안경(블루라이트)', '기타'],
  },
  {
    id: 16,
    question: '선호하는 근무 환경',
    answer: ['원격', '상주', '반반', '기타'],
  },
  {
    id: 17,
    question: '비전공자라면 전공 했던 분야 (언어, 생명과학... 기타등등)',
    answer: ['인문', '공학', '예체능', '자연', '기타'],
  },
  {
    id: 18,
    question: '개발자가 될 수 있을 것 같은 자신감 (1~10 점수)',
    answer: ['0', '3', '5', '7', '10'],
  },
  {
    id: 19,
    question: '부먹 찍먹',
    answer: ['부먹', '찍먹', '기타'],
  },
];

export default data;
